{
  "blogs": [
    {
      "slug": "2024-04-25",
      "headline": "How a free social art community at UT Austin is impacting artists as shown through their annual gallery night",
      "date": "April 25, 2024",
      "image": "",
      "imageText": "",
      "description": "Final feature story for J 310F",
      "post": [
        {
          "type": "text",
          "value": "With the semester nearing its end, the month of April tightens its grip on the University of Texas campus as students find themselves lost in the stress of deadlines and finals. Amid the end-of-year chaos emerged an enchanting mythology-themed escape, Collaborative Artists of UT’s Gallery Night, to celebrate the magic of art in all forms."
        },
        {
          "type": "text",
          "value": "Tables dressed in shimmering gold fabric topped with white lilies and roses filled the Texas Union’s Quadrangle Room April 19 for the club’s annual semi-formal event of art appreciation, music and socialization. Laughter and conversation filled the room as students gathered to support each other’s creations."
        },
        {
          "type": "text",
          "value": "Collaborative Artists member Clarisse Tudon described the club as for anyone interested in art in any capacity, fostering a diverse and welcoming community of creatives."
        },
        {
          "type": "text",
          "value": "“People join regardless of skill level or the kind of art they’re interested in,” Tudon said. “Some members write and some make poetry or do photography, so there’s a lot of different mediums and it’s really interesting to see.”"
        },
        {
          "type": "text",
          "value": "The event’s theme intertwined with Collaborative Artists’ most recent digital and mythology-themed magazine. The intricately crafted photo backdrop, adorned with draping vines and faux ancient architectural columns helped set the stage as the digital works of members’ mythogically-inspired digital pieces were revealed overhead."
        },
        {
          "type": "text",
          "value": "The group’s public relations officer Allison Biek’s stand-out interpretation of Aphrodite was among the digital artworks featured. Biek said she wanted her version of Aphrodite to portray normal and beautiful features that are often criticized and overlooked in a lot of art."
        },
        {
          "type": "text",
          "value": "“Because she is the goddess of love and beauty, I decided to represent things that aren’t always considered beautiful in our society,” Biek said. “I gave my Aphrodite stretch marks, hip dips, body hair and a fuller figure because I wanted to push back against typical portrayals of Aphrodite in the media.”"
        },
        {
          "type": "text",
          "value": "Collaborative Artists member Michelle Hsu had a different approach with her magazine fan art, “A Story for One Person.” Hsu said since this piece was heavily inspired by the epilogue of author Sing Shong’s novel “Omniscent Reader’s Viewpoint.”"
        },
        {
          "type": "text",
          "value": "“I don’t draw much fan art, mostly original stuff,” Hsu said. “But, occasionally there are random stories that click to me with specific groups of characters, and this novel stood out to me to want to draw about it.”"
        },
        {
          "type": "text",
          "value": "Collaborative Artists’ creatives may differ vastly in terms of art style or category, but many of the artists draw inspiration from the same things or in similar ways."
        },
        {
          "type": "text",
          "value": "While Tudon had a digital piece of the Greek God of wine, Dionysus, displayed from the digital magazine, her impressive two physical acrylic paintings boasted great attention to detail and sharp side profile portraits. Tudon said she often watches movies where she finds herself inspired to paint certain characters differently than they are represented in the film."
        },
        {
          "type": "text",
          "value": "“The first painting is of James Spader in the film ‘Crash’ and the second is Alan Rickman from ‘Truly Madly Deeply,’” Tudon said. “I really like their acting styles, and I love how diverse each of the roles they play are, so I like to paint their characters as the opposite of how they’re shown.”"
        },
        {
          "type": "text",
          "value": "The evening’s atmosphere transformed following the physical gallery walk and digital art displays, as the club’s officers led activities like playing “Just Dance”. Pop singer Kesha’s hit song, “Tik Tok” energized the room as giggles escaped from the members with every dance move."
        },
        {
          "type": "text",
          "value": "The closeness and inclusivity of Collaborative Artists was not only visibly apparent in this moment, but also heartwarming to witness."
        },
        {
          "type": "text",
          "value": "“We were able to find enjoyment and quality time in celebrating our artistic achievements and doing fun activities,” said Faustin Puno, first-year student and one of Collaborative Artists’ junior officers."
        },
        {
          "type": "text",
          "value": "Puno said he was able to experience a unique sense of belonging and inclusivity he couldn’t seem to find in other organizations."
        },
        {
          "type": "text",
          "value": "“Being a freshman in college, I felt like a small fish in a vast ocean, seeking a sense of belonging where I felt comfortable expressing my passion for art with like-minded creatives,” Puno said. “Finding people with common ground who are comfortable with authentically expressing themselves made me feel welcomed and appreciated for my presence.”"
        },
        {
          "type": "text",
          "value": "Biek said she was focused mostly on completing officer duties during the gallery night instead of participating, but enjoyed witnessing the fun she helped create."
        },
        {
          "type": "text",
          "value": "“The gallery night is a great opportunity for the artists to socialize with other members and form deeper connections with people they are already close to,” Biek said. “Overall, the camaraderie and seeing artists supporting fellow artists made all the stress of getting the event together worth it.”"
        }
      ]
    },
    {
      "slug": "2025-04-07",
      "headline": "Gilded Lillies",
      "date": "April 7, 2025",
      "image": "liv_photos_1.jpg",
      "imageText": "Gilded Lillies",
      "description": "Editorial for Glazezine Issue XII, Zenith. The phrase ‘Gilding the Lily” refers indicates that something has been unnecessarily decorated or over-embellished; the idea that it is impossible to improve something that is already perfect. There is beauty in what already exists naturally - there is no need to adorn something already beautiful.",
      "post": [
        {
          "type": "text",
          "value": "I sit on branches and appreciate the moss"
        },
        {
          "type": "text",
          "value": "Look to the earth"
        },
        {
          "type": "text",
          "value": "And see the art I never found in a mirror"
        },
        {
          "type": "text",
          "value": "I feel pure when my hands are dirty"
        },
        {
          "type": "text",
          "value": "Though I’d never admit it"
        },
        {
          "type": "text",
          "value": "Born from purity"
        },
        {
          "type": "text",
          "value": "Grown to expect"
        },
        {
          "type": "text",
          "value": "perfection"
        },
        {
          "type": "text",
          "value": "All flesh rots"
        },
        {
          "type": "text",
          "value": "I’ll return"
        },
        {
          "type": "text",
          "value": "To myself, to the dirt"
        },
        {
          "type": "text",
          "value": "The ground will be more forgiving"
        },
        {
          "type": "text",
          "value": "The bugs come as they are"
        },
        {
          "type": "text",
          "value": "But I listened to the world"
        },
        {
          "type": "text",
          "value": "Wore my vanity around my neck"
        },
        {
          "type": "text",
          "value": "As if it were the one thing holding up my head"
        },
        {
          "type": "text",
          "value": "Learned to mimic the voices of everyone I’ve ever admired"
        },
        {
          "type": "text",
          "value": "Basked in the sublimity"
        },
        {
          "type": "text",
          "value": "Hoping it would soak into each pore"
        },
        {
          "type": "text",
          "value": "Make me better"
        },
        {
          "type": "text",
          "value": "So I listened"
        },
        {
          "type": "text",
          "value": "Born from purity"
        },
        {
          "type": "text",
          "value": "Perception cuts"
        },
        {
          "type": "text",
          "value": "Down to the roots I find solace in,"
        },
        {
          "type": "text",
          "value": "Perfection."
        }
      ]
    }
  ]
}
